# ************************************************************
# Sequel Pro SQL dump
# Version 4541
#
# http://www.sequelpro.com/
# https://github.com/sequelpro/sequelpro
#
# Host: 127.0.0.1 (MySQL 5.7.19)
# Database: dyh_test
# Generation Time: 2018-07-01 03:32:25 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# Dump of table address
# ------------------------------------------------------------

DROP TABLE IF EXISTS `address`;

CREATE TABLE `address` (
  `id` int(11) NOT NULL COMMENT '主键id',
  `province` varchar(20) NOT NULL DEFAULT '' COMMENT '省',
  `city` varchar(20) NOT NULL DEFAULT '0' COMMENT '市',
  `area` varchar(20) NOT NULL DEFAULT '0' COMMENT '区',
  `address` varchar(255) NOT NULL DEFAULT '0' COMMENT '地址',
  `create_time` datetime NOT NULL,
  `update_time` datetime NOT NULL,
  `contact` varchar(20) NOT NULL DEFAULT '0' COMMENT '联系人',
  `appellation` varchar(15) NOT NULL DEFAULT '' COMMENT '称呼',
  `deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否删除',
  `mobile` varchar(20) NOT NULL DEFAULT '' COMMENT '手机号',
  `status` int(11) NOT NULL COMMENT '状态：1-默认地址',
  `user_id` int(11) NOT NULL COMMENT '用户Id',
  `province_id` int(11) NOT NULL DEFAULT '0' COMMENT '省Id',
  `city_id` int(11) NOT NULL DEFAULT '0' COMMENT '市Id',
  `area_id` int(11) NOT NULL DEFAULT '0' COMMENT '区Id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `address` WRITE;
/*!40000 ALTER TABLE `address` DISABLE KEYS */;

INSERT INTO `address` (`id`, `province`, `city`, `area`, `address`, `create_time`, `update_time`, `contact`, `appellation`, `deleted`, `mobile`, `status`, `user_id`, `province_id`, `city_id`, `area_id`)
VALUES
	(4,'广东省','广州市','海珠区','我你你你我我我在我你在我你在我这在你一这在一这一不这一在','2018-02-06 17:39:59','2018-02-06 17:48:36','林林','先生',1,'18999992222',0,8,0,0,0),
	(5,'广东省','广州市','海珠区','我你ta3','2018-02-06 17:41:51','2018-02-08 15:08:11','林林','先生',1,'18999992222',0,8,0,0,0),
	(8,'北京市','市辖区','东城区','cccccvvv','2018-02-07 10:44:22','2018-02-07 11:29:06','cccc','先生',1,'12386544487',0,0,0,0,0),
	(9,'山西省','大同市','矿区','bnbnbnbn','2018-02-07 11:43:40','2018-02-07 11:43:49','ccc','先生',1,'13800138000',0,0,140000,140200,140203),
	(10,'内蒙古自治区','呼和浩特市','回民区','ccccddd','2018-02-07 12:00:31','2018-02-07 14:35:58','bbdd','先生',0,'13800138001',0,0,150000,150100,150103),
	(11,'河北省','秦皇岛市','山海关区','斯蒂芬尺寸','2018-02-07 15:14:07','2018-02-08 18:00:27','yy','女士',1,'13800138000',0,0,130000,130300,130303),
	(12,'山西省','长治市','屯留县','参谋参谋参谋处','2018-02-08 15:08:47','2018-02-08 15:08:47','尺寸','先生',0,'13800138000',0,8,140000,140400,140424),
	(13,'北京市','市辖区','东城区','123445','2018-02-08 17:56:49','2018-02-08 17:59:30','13660821692','先生',0,'1366082169*777',0,0,110000,110100,110101),
	(14,'宁夏回族自治区','银川市','市辖区','121111111111112345（仿佛吃饭喝酒一样一样天天给别人带来','2018-02-08 18:02:53','2018-02-08 18:02:53','片','女士',0,'13660821692',0,0,640000,640100,640101),
	(15,'北京市','市辖区','东城区','111111111111112225557856555555','2018-02-08 18:31:12','2018-02-08 18:31:12','测试','女士',0,'13660821692',0,0,110000,110100,110101),
	(16,'北京市','市辖区','东城区','1111111111111111111','2018-02-08 19:10:11','2018-02-08 19:10:11','测试6','先生',0,'13660821692',0,112,110000,110100,110101),
	(17,'北京市','市辖区','东城区','铁路局聚聚2','2018-02-08 19:13:26','2018-02-08 19:23:59','362','先生',1,'13549895083',0,112,110000,110100,110101),
	(18,'广东省','广州市','海珠区','123号','2018-02-08 21:53:48','2018-02-08 21:53:48','李文燕','女士',0,'15813342354',0,67,440000,440100,440105),
	(19,'广东省','中山市','','一二三道四五六区七八九号','2018-02-23 14:12:46','2018-02-26 14:49:01','yue','先生',0,'15817163240',0,10178,440000,442000,0),
	(20,'北京市','市辖区','东城区','789654321','2018-02-23 14:13:10','2018-02-24 15:54:50','yue','先生',1,'15817163240',0,10178,110000,110100,110101),
	(21,'云南省','怒江傈僳族自治州','兰坪白族普米族自治县','123456789456132484678794646464665','2018-02-24 15:53:44','2018-02-24 16:58:07','哈哈哈','先生',1,'15817163240',0,10178,530000,533300,533325),
	(22,'湖南省','长沙市','浏阳市','12345678945613248787887878878787','2018-02-24 16:34:26','2018-02-24 16:37:03','好','先生',0,'15817163240',0,10178,430000,430100,430181),
	(23,'广东省','清远市','连山壮族瑶族自治县','78979797954545545454454554645454','2018-02-24 16:39:51','2018-02-24 16:58:43','好','先生',0,'15817163240',0,10178,440000,441800,441825),
	(24,'湖南省','湘西土家族苗族自治州','吉首市','87878788787979797979870000000181818848448480484946466767686866868656656564665656565665656565665656566565656656564665','2018-02-24 16:40:21','2018-02-24 16:58:04','有','先生',1,'15817163240',0,10178,430000,433100,433101),
	(25,'陕西省','榆林市','清涧县','487878875757557575475575757576676755765958646565646657667','2018-02-24 16:40:49','2018-02-26 14:21:35','天','先生',1,'15817163240',0,10178,610000,610800,610830),
	(26,'广东省','广州市','市辖区','1111去我家嗯例如我基本例如我基本例如我急本机去我','2018-02-26 13:59:35','2018-02-26 13:59:35','哦','先生',0,'15817163240',0,10178,440000,440100,440101),
	(27,'澳门特别行政区','','','444444556655','2018-02-26 14:49:23','2018-02-26 14:49:23','123','先生',0,'15817163240',0,10178,820000,0,0);

/*!40000 ALTER TABLE `address` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
